--- a/design/llm-design.md
+++ b/design/llm-design.md
@@ -64,81 +55,93 @@ Array of message objects, where each object contains:
-details via its own functions.
-
 ## Class Diagram
-```plantuml
-@startuml
-!theme reddress-darkgreen
+```mermaid
+classDiagram
+    note for llm "send the request using **vim.system**"
 
-class "llm" <<module>> {
-    + send(request, callbacks) : abort
-}
+    class llm {
+        <<module>>
+        +send(request, callbacks) abort
+    }
 
-note left of llm: send the request using **vim.system**
+    class abort {
+        <<function>>
+        +call() void
+    }
 
-interface "abort" <<function>> {
-  + call() : void
-}
+    class driver_factory {
+        <<module>>
+        +get(provider) driver
+    }
 
-class "driver_factory" << module >> {
-    + get(provider) : driver
-}
+    class openai {
+        <<module>>
+        +new(api_key, base_url) driver
+    }
 
-class "openai" << module >> {
-    + new(api_key, base_url) : driver
-}
-class "gemini" << module >> {
-    + new(api_key) : driver
-}
+    class gemini {
+        <<module>>
+        +new(api_key) driver
+    }
 
-class "driver" <<table>> {
-    + spec(request) : {url, headers, body} 
-    + parse(chunk) : string
-}
+    class driver {
+        <<table>>
+        +spec(request) Map
+        +parse(chunk) string
+    }
 
-class "request" <<table>> {
-    + context: {provider, model, stream}
-    + messages: [{role, content}]
-    + options: {temp, top_p, ...}
-}
+    class request {
+        <<table>>
+        +context
+        +messages
+        +options
+    }
 
-' Relationships
-llm ..> request : uses
-llm ..> abort : returns
-llm ..> driver_factory : uses
+    %% Relationships
+    llm ..> request : uses
+    llm ..> abort : returns
+    llm ..> driver_factory : uses
 
-openai ..> driver : returns
-gemini ..> driver : returns
+    openai ..> driver : returns
+    gemini ..> driver : returns
 
-driver_factory ..> openai : uses
-driver_factory ..> gemini : uses
-
-driver_factory ..> driver : returns
-
-@enduml
+    driver_factory ..> openai : uses
+    driver_factory ..> gemini : uses
+    driver_factory ..> driver : returns
 ```
